# Бројевни изрази
2024
2000 + 24
1 // (2 - 3) + (4 + (5 + 6)) * (7 + 8) * 9

# Функције
abs(-2)

# Вредности
"Напред Звездо!"

# Објекти
# - преузето са https://github.com/milovanovic/ivoandric/blob/master/Drina.txt
дрина = open('Drina.txt')
текст = дрина.read().split()
len(текст)
текст[:25]
текст.count('ћуприја')
текст.count('Дрина')
текст.count('на')
текст.count('и')

# Скупови
речи = set(текст)
len(речи)

# Комбинације
'начет'
'начет'[0]
{реч[0] for реч in речи}

# Подаци
'начет'[::-1]
{реч for реч in речи if реч == реч[::-1] and len(реч)>3}
{реч for реч in речи if реч[::-1] in речи and len(реч) == 4}
{реч for реч in речи if реч[::-1] in речи and len(реч) > 4}
