# Позивни изрази
max(2, 3)
min(1, -2, 3, -4, 5)
pow(100, 2)
pow(2, 100)

# Увози
from math import pi
pi * 7 / 22
pi * 71 / 223
from math import sin
sin(pi/2)

# Додела
полупречник = 10
пречник = 2 * полупречник
површина, обим = pi * полупречник ** 2, пречник * pi
полупречник = 20

# Вредности функција
max
max(3, 4)
f = max
f
f(3, 4)
max = 7
f(3, 4)
f(3, max)
f = 2
# f(3, 4)
__builtins__.max

# Кориснички-дефинисане функције
from operator import add, mul

def квадрат(x):
    return mul(x, x)

квадрат(21)
квадрат(add(2, 5))
квадрат(квадрат(3))

def збирКвадрата(x, y):
    return add(квадрат(x), квадрат(y))
збирКвадрата(3, 4)
збирКвадрата(5, 12)

# функција површина
def површина():
    return pi * полупречник * полупречник
површина()
полупречник = 20
површина()
полупречник = 10
површина()

# Конфлитки имена
def квадрат(квадрат):
    return mul(квадрат, квадрат)
квадрат(4)
