# Испис (print)
-2
print(-2)
print(1, 2, 3)
x = -2
x
print(x)
x = print(-2)
x
print(x)

None
1
'ћао'
abs

print(None)
print(1, 2, 3)
print(None, None)
print(print(1), print(2))


def f(x):
    return x + 1

def g(x):
    print(x + 1)

f(3) + 2
# g(3) + 2

# Дељење
618 / 10
618 // 10
618 % 10
from operator import truediv, floordiv, mod
floordiv(618, 10)
truediv(618, 10)
mod(618, 10)

# Апроксимација
5 / 3
5 // 3
5 % 3

# Вишеструке повратне вредности
def дели_тачно(б, и):
    return б // и, б % и
количник, остатак = дели_тачно(618, 10)

# Докниске, доктестови и подразумевани аргументи
def дели_тачно(б, и=10):
    """Враћа количник и остатак при дељењу Б са И.

    >>> количник, остатак = дели_тачно(618, 10)
    >>> количник
    61
    >>> остатак
    8
    """
    return floordiv(б, и), mod(б, и)

# Условни изрази
def апсолутна_вредност(x):
    """Враћа апсолутну вредност од X.

    >>> апсолутна_вредност(-3)
    3
    >>> апсолутна_вредност(0)
    0
    >>> апсолутна_вредност(3)
    3
    """
    if x < 0:
        return -x
    elif x == 0:
        return 0
    else:
        return x

# Сабирање преко while петље
i, збир = 0, 0
while i < 3:
    i = i + 1
    збир = збир + i
print('i:', i, 'збир:', збир)
