# Факторизација
def прости_чиниоци(n):
    """Исписује просте чиниоце природног броја n у неопадајућем редоследу

    >>> прости_чиниоци(8)
    2
    2
    2
    >>> прости_чиниоци(9)
    3
    3
    >>> прости_чиниоци(10)
    2
    5
    >>> прости_чиниоци(11)
    11
    >>> прости_чиниоци(12)
    2
    2
    3
    >>> прости_чиниоци(858)
    2
    3
    11
    13
    """
    while n > 1:
        k = најмањи_чинилац(n)
        print(k)
        n = n // k

def најмањи_чинилац(n):
    """Враћа најмањи чинилац броја n већи од 1."""
    k = 2
    while n % k != 0:
        k = k + 1
    return k
