# Декоратери

def траг1(fn):
    """Враћа верзију fn која исписује пре него што је позвана.

    fn - функција једног аргумента
    """
    def трасирана(x):
        print('Позив', fn, 'над аргументом', x)
        return fn(x)
    return трасирана

@траг1
def квадрат(x):
    """
    >>> квадрат(12)
    144
    """
    return x * x

@траг1
def збир_квадрата_до(n):
    """
    >>> збир_квадрата_до(5)
    55
    """
    k = 0
    збир = 0
    while k <= n:
        збир, k = збир + квадрат(k), k + 1
    return збир

# Декорација @траг1 је еквивалентна наредби:
# квадрат = траг1(квадрат) # односно
# збир_квадрата_до = траг1(збир_квадрата_до)
