# Одсецање

непарни = [3, 5, 7, 9, 11]
list(range(1, 3))
[непарни[i] for i in range(1, 3)]
непарни[1:3]
непарни[1:]
непарни[:3]
непарни[:]

# Агрегација

sum(непарни)
sum({3:9, 5:25})
max(range(10))
max(range(10), key=lambda x: 7 - (x-2)*(x-4))
all([x < 5 for x in range(5)])
потпуни_квадрат = lambda x: x == round(x ** 0.5) ** 2
any([потпуни_квадрат(x) for x in range(50, 60)]) # испробајте и до 65)

# Речници

def dict_demos():
    римски = {'I': 1, 'V': 5, 'X': 10}
    римски['X']
    # римски['X-зрак']
    # римски[10]
    len(римски)
    list(римски)
    римски.values()
    list(римски.values())
    sum(римски.values())
    dict([[3, 9], [4, 16]])
    римски.get('X', 0)
    римски.get('X-зрак', 0)
    {1: 2, 1: 3}
    {[1]: 2}
    {1: [2]}

def индекс(кључеви, вредности, спарени):
    """Враћа речник који повезује сваки од кључева k на низ вредности v за које је спарени(k, v) тачно.

    >>> индекс([7, 9, 11], range(30, 50), lambda k, v: v % k == 0)
    {7: [35, 42, 49], 9: [36, 45], 11: [33, 44]}
    """
    return {k: [v for v in вредности if спарени(k, v)] for k in кључеви}
