# Рационална аритметика

def збир_рационалних(x, y):
    """Збир рационалних бројева X и Y."""
    бx, иx = бројилац(x), именилац(x)
    бy, иy = бројилац(y), именилац(y)
    return рационалан(бx * иy + бy * иx, иx * иy)

def производ_рационалних(x, y):
    """Производ рационалних бројева X и Y."""
    return рационалан(бројилац(x) * бројилац(y), именилац(x) * именилац(y))

def рационални_су_једнаки(x, y):
    """Тачно акко су рационални бројеви X и Y једнаки."""
    return бројилац(x) * именилац(y) == бројилац(y) * именилац(x)

def print_рационалан(x):
    """Исписује рационалан број X."""
    print(бројилац(x), "/", именилац(x))


# Конструктор и селектори

def рационалан(б, и):
    """Представа рационалног броја Б/И."""
    return [б, и]

def бројилац(x):
    """Враћа бројилац рационалног броја X."""
    return x[0]

def именилац(x):
    """Враћа именилац рационалног броја X."""
    return x[1]


# Побољшана спецификација

from math import gcd
def рационалан(б, и):
    """Представа рационалног броја Б/И."""
    нзд = gcd(б, и)
    return [б//нзд, и//нзд]

def бројилац(x):
    """Враћа сведен бројилац рационалног броја X истог знака као и X."""
    return x[0]

def именилац(x):
    """Враћа апсолутну вредност сведеног имениоца рационалног броја X."""
    return x[1]


# Функционална имплементација

def рационалан(б, и):
    """Представа рационалног броја Б/И."""
    нзд = gcd(б, и)
    б, и = б//нзд, и//нзд
    def избор(име):
        if име == 'б':
            return б
        elif име == 'и':
            return и
    return избор

def бројилац(x):
    """Враћа сведен бројилац рационалног броја X истог знака као и X."""
    return x('б')

def именилац(x):
    """Враћа апсолутну вредност сведеног имениоца рационалног броја X."""
    return x('и')
