def датум_демо():
    from datetime import date
    данас = date(2022, 11, 28)
    слобода = date(2022, 12, 31)
    str(слобода - данас)
    данас.year
    данас.strftime('%A, %B %d')
    type(данас)

def ниска_демо():
    "Здраво".lower()
    "Здраво".upper()
    "Здраво".swapcase()
    hex(ord('A'))
    print('\a')
    print('1\n2\n3')
    from unicodedata import lookup, name
    name('A')
    lookup('SNOWMAN')
    lookup('SOCCER BALL')
    lookup('BABY')
    s = lookup('SNOWMAN')

def низ_демо():
    знакови = ['новчић', 'ниска', 'мирјада']  # литерал низа
    изворни_знакови = знакови
    знакови.pop()            # Избацује из низа и враћа последњи члан
    знакови.remove('ниска')  # Избацује први члан који је једнак аргументу
    знакови.append('пехар')            # Додаје члан на крај
    знакови.extend(['мач', 'палица'])  # Додаје све чланове низа на крај
    знакови[2] = 'пик'  # Замењује тј. мења члан
    знакови
    знакови[0:2] = ['херц', 'каро']  # Замењује тј. мења одрезак низа
    [знак.upper() for знак in знакови]
    [знак[1:4] for знак in знакови if len(знак) == 5]

def речник_демо():
    римски = {'I': 1.0, 'V': 5, 'X': 10}
    римски['X']
    римски['I'] = 1
    римски['L'] = 50
    римски
    sum(римски.values())
    dict([(3, 9), (4, 16), (5, 25)])
    римски.get('A', 0)
    римски.get('V', 0)

def поворка_демо():
    (3, 4, 5, 6)
    3, 4, 5, 6
    ()
    tuple()
    tuple([1, 2, 3])
    # tuple(2)
    (2,)
    (3, 4) + (5, 6)
    (3, 4, 5) * 2
    5 in (3, 4, 5)

    # {[1]: 2}
    {1: [2]}
    {(1, 2): 3}
    # {([1], 2): 3}
    {tuple([1, 2]): 3}

def тачно_дељење(б, и):
    return б // и, б % и

def идентитет_демо():
    a = [10]
    b = a
    a == b
    a is b
    a.extend([20, 30])
    a == b
    a is b

    a = [10]
    b = [10]
    a == b
    a is not b
    a.append(20)
    a != b

def подизањеНовца(стање):
    с = [стање]
    def подигни(износ):
        if износ > с[0]:
            return 'Недовољно средстава на рачуну.'
        с[0] = с[0] - износ
        return с[0]
    return подигни
