class Кловн:
    """Илустрација class наредбе. Ова класа је бескорисна.

    >>> Кловн.нос
    'велики и црвен'
    >>> Кловн.играј()
    'Нека хвала'
    """
    нос = 'велики и црвен'
    def играј():
        return 'Нека хвала'


class Рачун:
    """Рачун има власника и стање.
    Сви рачуни деле заједничку камату.

    >>> р = Рачун('Влада')
    >>> р.власник
    'Влада'
    >>> р.депонуј(100)
    100
    >>> р.подигни(90)
    10
    >>> р.подигни(90)
    'Недовољно средстава'
    >>> р.стање
    10
    >>> р.камата
    0.02
    >>> Рачун.камата = 0.04
    >>> р.камата
    0.04
    """

    камата = 0.02  # Атрибут класе

    def __init__(self, власник_рачуна):
        self.власник = власник_рачуна
        self.стање = 0

    def депонуј(self, износ):
        """Додаје износ на стање."""
        self.стање = self.стање + износ
        return self.стање

    def подигни(self, износ):
        """Одузима износ од стања уколико је довољно."""
        if износ > self.стање:
            return 'Недовољно средстава'
        self.стање = self.стање - износ
        return self.стање
